SSAD/test/web-app/build/docs/imp/runtime/components/guard/add_role/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>add_role</code> route of the <code>Guard</code> component</title>
<!-- 2017-08-31 Thu 18:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
</head>
<body>
<div id="content">
<h1 class="title"><code>add_role</code> route of the <code>Guard</code> component</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Checks</a></li>
<li><a href="#sec-3">3. Implemenbtation</a>
<ul>
<li><a href="#sec-3-1">3.1. Imports and class <code>AddRole</code></a></li>
<li><a href="#sec-3-2">3.2. The type structure of the <code>add_role</code> route</a></li>
<li><a href="#sec-3-3">3.3. The <code>do</code> method</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Checks</a>
<ul>
<li><a href="#sec-4-1">4.1. Type checks</a></li>
<li><a href="#sec-4-2">4.2. Authorization check</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Steps</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. State check</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Packages</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the specification and implementation of the
<code>add_role</code> route of the <code>Guard</code> component.  
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Checks</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> TypeCheck </dt><dd>Check whether the instruction consists of the command
<code>add_role</code>, the <code>data</code> dictionary of <code>user</code> object of
type User , <code>addrole</code> object of type Role and
additionally contains a session object (and nothing
else).  The typecheck may be implemented by consulting
the <a href="../../../datatypes/instr/index.html">instruction datatype</a> specification.
</dd>
</dl>


<dl class="org-dl">
<dt> AuthCheck </dt><dd>Check whether the role in the session is <code>admin</code>.
Only admins are allowed to add roles to a user.
</dd>

<dt> StateCheck </dt><dd>Check whether the session in the instruction is
indeed an entity currently present in the entity
manager's session aggregate.
</dd>
</dl>

<p>
Note that there is a unique constraint on the role to be added to the
user,it should not already be present in the roles list of that user
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implemenbtation</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Imports and class <code>AddRole</code></h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> traceback
<span style="font-weight: bold;">from</span> runtime.exceptions.app.exception <span style="font-weight: bold;">import</span> AppException
<span style="font-weight: bold;">from</span> runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> check_pred
<span style="font-weight: bold;">from</span> runtime.datatypes.cmd.cmd <span style="font-weight: bold;">import</span> Cmd
<span style="font-weight: bold;">from</span> runtime.objects.session.session <span style="font-weight: bold;">import</span> Session
<span style="font-weight: bold;">from</span> runtime.objects.role.role <span style="font-weight: bold;">import</span> Role
<span style="font-weight: bold;">from</span> runtime.datatypes.instr.add_role.add_role_instr <span style="font-weight: bold;">import</span> AddRoleInstr

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">AddRole</span>:
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The type structure of the <code>add_role</code> route</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The <code>add_role</code> route is a dictionary with 'cmd' equal to
<code>Cmd.add_role</code>, a 'data' which is again a dictionary with 
'user' which is instance of class <code>User</code> and a 'session' 
that is an instance of <code>Session</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The <code>do</code> method</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This method takes a component and instruction and simply
does all the checks.
</p>
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span> 
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">do</span>(component, instr):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"add_role: %s"</span> % instr

        AddRole.check_type(instr)
        AddRole.check_auth(component, instr)
        AddRole.check_state(component, instr)
        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Checks</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Type checks</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Check if the the instruction is of the correct shape,
i.e. satisfies the predicate <code>AddRoleInstr.is_inst</code>.
</p>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_type</span>(instr):
         check_pred(AddRoleInstr.is_inst)(instr)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Authorization check</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The Authorization checks for the following two authorization
constraints:
</p>

<ol class="org-ol">
<li>Only an <code>admin</code> may perform the <code>add_role</code> operation
</li>

<li>The role that is to be added should not already be present in
the list of roles of the user.If not,an exception is to be raised.
</li>
</ol>
</div>

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Steps</h4>
<div class="outline-text-4" id="text-4-2-1">
<ol class="org-ol">
<li>Retrieve the session from the instr
</li>

<li>Retrieve the user from the session
</li>

<li>Retrieve the role from the session
</li>

<li>If the role is not an admin role (<code>Role.admin</code>) then
raise an exception.
</li>

<li>Get the roles of the user from the instruction's data key.
</li>

<li>Get the role from the instruction's addrole key.
</li>

<li>If the role to be added is a role of that 
user then raise an exception.
</li>
</ol>


<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_auth</span>(obj, instr):
        <span style="font-weight: bold; font-style: italic;">session</span> = instr[<span style="font-style: italic;">'session'</span>]
        
        <span style="font-weight: bold; font-style: italic;">role</span> = session.get(<span style="font-style: italic;">"role"</span>)
        <span style="font-weight: bold; font-style: italic;">user</span> = instr[<span style="font-style: italic;">'data'</span>][<span style="font-style: italic;">'user'</span>]
        <span style="font-weight: bold; font-style: italic;">roles</span> = user.get(<span style="font-style: italic;">'roles'</span>)
        <span style="font-weight: bold; font-style: italic;">addrole</span> = instr[<span style="font-style: italic;">'data'</span>][<span style="font-style: italic;">'addrole'</span>]
        <span style="font-weight: bold;">if</span> role != Role.admin:
            <span style="font-weight: bold;">raise</span> AppException(op=<span style="font-style: italic;">"add_role.check_auth"</span>, 
                msg=<span style="font-style: italic;">"Only admin can add a role"</span>)
        <span style="font-weight: bold;">if</span> addrole <span style="font-weight: bold;">in</span> roles :
            <span style="font-weight: bold;">raise</span> AppException(op=<span style="font-style: italic;">"add_role.check_auth"</span>,
                msg=<span style="font-style: italic;">"cannot add role"</span>)
        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> State check</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This check passes if the session is already an entity
present in the entity manager.  Otherwise an exception
is raised.
</p>

<ol class="org-ol">
<li>Retrieve the session from the instruction.
</li>

<li>Retrieve the entity manager from the component.
</li>

<li>Check if the session is present in the entity
manager. 
</li>

<li>If the session is not present, then raise an
exception.  The instruction's session must always be
in the session aggregate managed by the entity manager.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_state</span>(component, instr):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> component.em.is_present(instr[<span style="font-style: italic;">'session'</span>]):
            <span style="font-weight: bold;">raise</span> AppException(op=<span style="font-style: italic;">"add_role.check_state"</span>,
                                   msg=<span style="font-style: italic;">"session is not in the entity manager"</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Packages</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">print</span> <span style="font-style: italic;">"runtime.components.guard.add_role package"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-07-10 Mon]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-08-31 Thu 18:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
